# week_02일차 파이썬 프로그래밍

# Pandas

파이썬으로 구현한 엑셀 스프레드시트

In [63]:
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity = 'all'

- DataFrame이 무엇인지 이해한다.
- csv파일, 엑셀파일, DB의데이터를 가져오고 다시 저장해본다
- 탐색적분석을 수행해 본다
- 필요한 데이터를 선택해 가져온다
- 변수를 만들어 Dataframe에 추가하고 삭제한다
- DataFrame을 서로 연결한다

In [64]:
import pandas as pd

In [67]:
pd

## 1. 직접 만들기
### 1.1 list로 만들기

In [68]:
mylist = [[1,4,7],[2,5,8], [3,6,9]]
mylist

[[1, 4, 7], [2, 5, 8], [3, 6, 9]]

In [69]:
pd.DataFrame(mylist)

   0  1  2
0  1  4  7
1  2  5  8
2  3  6  9

In [70]:
pd.DataFrame(mylist, columns=['a', 'b', 'c'], index=[10,11,12])

    a  b  c
10  1  4  7
11  2  5  8
12  3  6  9

### 1.2 numpy array로 만들기

In [71]:
import numpy as np

In [72]:
pd.DataFrame(np.array(mylist))

   0  1  2
0  1  4  7
1  2  5  8
2  3  6  9

In [73]:
a = np.arange(1,10).reshape(3,3).T
a

array([[1, 4, 7],
       [2, 5, 8],
       [3, 6, 9]])

In [74]:
pd.DataFrame(a, columns=['a', 'b', 'c'], index=[10,11,12])

    a  b  c
10  1  4  7
11  2  5  8
12  3  6  9

### 1.3 dictionary로 만들기

In [75]:
mydict = {'a': [1,2,3], 'b': [4,5,6], 'c':[7,8,9]}
mydict

{'a': [1, 2, 3], 'b': [4, 5, 6], 'c': [7, 8, 9]}

In [76]:
pd.DataFrame(mydict)

   a  b  c
0  1  4  7
1  2  5  8
2  3  6  9

In [77]:
pd.DataFrame(mydict, index=[10,11,12])

    a  b  c
10  1  4  7
11  2  5  8
12  3  6  9

In [78]:
pd.DataFrame(mydict, columns=['c', 'b', 'a'], index=[10,11,12])

    c  b  a
10  7  4  1
11  8  5  2
12  9  6  3

### 4. 외부데이터 읽기(csv, 읽고 쓰기)
<font color='red'> 공공데이터 자료 읽기  --> Python_pandas_part1

## 5. Indexing (loc, iloc)
- loc은 Index가 가지고 있는 값을 기준으로 동작
- iloc은 index의 위치 기준으로 동작합니다.(정수만 사용)

In [79]:
np.random.seed(1357)  # 제3자와 무작위난수값을 동일하게하여 재현이 가능하도록
m = np.random.randint(1,100,12)
data = m.reshape((3,4))
df = pd.DataFrame(data, columns=['a', 'b', 'c', 'd'], index=[10,11,12])
df

     a   b   c   d
10  52  71  72  80
11  72  53  71  46
12  68  59  55  19

In [80]:
df.loc[10]   # loc는 index의 값을
df.iloc[0]   # iloc는 index의 위치 값을 (행렬처럼)

a    52
b    71
c    72
d    80
Name: 10, dtype: int32

a    52
b    71
c    72
d    80
Name: 10, dtype: int32

## iloc와 loc의 indexing 차이점

In [81]:
df.iloc[0:2, 1:3]
df.loc[10:11, 'b':'c']

     b   c
10  71  72
11  53  71

     b   c
10  71  72
11  53  71

In [82]:
df.loc[11, 'b']
df.iloc[1, 1]

53

53

In [83]:
df['a']
type(df['a'])

df[['a','b']]
type(df[['a','b']])

10    52
11    72
12    68
Name: a, dtype: int32

pandas.core.series.Series

     a   b
10  52  71
11  72  53
12  68  59

pandas.core.frame.DataFrame

In [84]:
df[['a','b']].loc[12]

a    68
b    59
Name: 12, dtype: int32

In [85]:
df[1:]
df[-1:]

     a   b   c   d
11  72  53  71  46
12  68  59  55  19

     a   b   c   d
12  68  59  55  19

In [86]:
df['a']
df.a

10    52
11    72
12    68
Name: a, dtype: int32

10    52
11    72
12    68
Name: a, dtype: int32

## 6. 조건

In [87]:
df

     a   b   c   d
10  52  71  72  80
11  72  53  71  46
12  68  59  55  19

In [88]:
df>=60

        a      b      c      d
10  False   True   True   True
11   True  False   True  False
12   True  False  False  False

In [89]:
df[df>=60]

       a     b     c     d
10   NaN  71.0  72.0  80.0
11  72.0   NaN  71.0   NaN
12  68.0   NaN   NaN   NaN

In [90]:
df[df['c']>60]
df[(df['c']>50)&(df['c']<70)]

     a   b   c   d
10  52  71  72  80
11  72  53  71  46

     a   b   c   d
12  68  59  55  19

In [91]:
df = df[df>60].copy()
df['e'] = ['owl', 'fox', 'owl']
df

       a     b     c     d    e
10   NaN  71.0  72.0  80.0  owl
11  72.0   NaN  71.0   NaN  fox
12  68.0   NaN   NaN   NaN  owl

In [92]:
df.isnull().sum()
df.nunique()

a    1
b    2
c    1
d    2
e    0
dtype: int64

a    2
b    1
c    2
d    1
e    2
dtype: int64

## 7. 결측치 대체

In [93]:
df
df.fillna(0)
df.fillna(0, inplace = True)  # df = df.fillna(0)
df

       a     b     c     d    e
10   NaN  71.0  72.0  80.0  owl
11  72.0   NaN  71.0   NaN  fox
12  68.0   NaN   NaN   NaN  owl

       a     b     c     d    e
10   0.0  71.0  72.0  80.0  owl
11  72.0   0.0  71.0   0.0  fox
12  68.0   0.0   0.0   0.0  owl

       a     b     c     d    e
10   0.0  71.0  72.0  80.0  owl
11  72.0   0.0  71.0   0.0  fox
12  68.0   0.0   0.0   0.0  owl

In [94]:
df.drop('e', axis=1, inplace = True)

In [95]:
df

       a     b     c     d
10   0.0  71.0  72.0  80.0
11  72.0   0.0  71.0   0.0
12  68.0   0.0   0.0   0.0

In [96]:
df.drop(['a', 'c'], axis=1)

       b     d
10  71.0  80.0
11   0.0   0.0
12   0.0   0.0

## 8. 중복 제거

In [97]:
df

       a     b     c     d
10   0.0  71.0  72.0  80.0
11  72.0   0.0  71.0   0.0
12  68.0   0.0   0.0   0.0

In [98]:
df['e'] = df['b']
df

       a     b     c     d     e
10   0.0  71.0  72.0  80.0  71.0
11  72.0   0.0  71.0   0.0   0.0
12  68.0   0.0   0.0   0.0   0.0

In [99]:
df.loc[13] = df.loc[11]
df

       a     b     c     d     e
10   0.0  71.0  72.0  80.0  71.0
11  72.0   0.0  71.0   0.0   0.0
12  68.0   0.0   0.0   0.0   0.0
13  72.0   0.0  71.0   0.0   0.0

In [100]:
df.duplicated()

10    False
11    False
12    False
13     True
dtype: bool

In [101]:
df[~df.duplicated()]

       a     b     c     d     e
10   0.0  71.0  72.0  80.0  71.0
11  72.0   0.0  71.0   0.0   0.0
12  68.0   0.0   0.0   0.0   0.0

## 9. 텍스트 처리

In [102]:
txt = '    필 땐 장미꽃처럼, 흩날릴 땐 벚꽃처럼, 질 땐 나팔꽃처럼'
txt2 = '아름다운 그 순간처럼, 어짜피 이것 밖에 난 못해'
txt3 = '너를 사랑하는 것 밖엔 못해'
type(txt)

str

In [103]:
txt + txt2

'    필 땐 장미꽃처럼, 흩날릴 땐 벚꽃처럼, 질 땐 나팔꽃처럼아름다운 그 순간처럼, 어짜피 이것 밖에 난 못해'

In [104]:
txt.split() # list변환
type(txt.split())

['필', '땐', '장미꽃처럼,', '흩날릴', '땐', '벚꽃처럼,', '질', '땐', '나팔꽃처럼']

list

In [105]:
' '.join(txt.split(' '))

'    필 땐 장미꽃처럼, 흩날릴 땐 벚꽃처럼, 질 땐 나팔꽃처럼'

In [106]:
txt.strip() # 양 쪽 끝의 공백을 제거

'필 땐 장미꽃처럼, 흩날릴 땐 벚꽃처럼, 질 땐 나팔꽃처럼'

In [107]:
txt[0:10]
txt.find('장미')

'    필 땐 장미'

8

In [108]:
txt.replace('장미', '해바라기')
txt.strip().replace('장미', '해바라기')

'    필 땐 해바라기꽃처럼, 흩날릴 땐 벚꽃처럼, 질 땐 나팔꽃처럼'

'필 땐 해바라기꽃처럼, 흩날릴 땐 벚꽃처럼, 질 땐 나팔꽃처럼'

In [109]:
doc = pd.Series([txt, txt2, txt3], dtype="string")
doc = doc.to_frame()
doc

                                      0
0      필 땐 장미꽃처럼, 흩날릴 땐 벚꽃처럼, 질 땐 나팔꽃처럼
1           아름다운 그 순간처럼, 어짜피 이것 밖에 난 못해
2                       너를 사랑하는 것 밖엔 못해

In [110]:
doc[0].str.contains('장미') # 시리즈에 적용

0     True
1    False
2    False
Name: 0, dtype: boolean

In [111]:
for choice in ['장미', '벚꽃', '사랑'] :
    doc[choice] = doc[0].str.contains(choice).fillna(0).astype(int)
doc

                                      0  장미  벚꽃  사랑
0      필 땐 장미꽃처럼, 흩날릴 땐 벚꽃처럼, 질 땐 나팔꽃처럼   1   1   0
1           아름다운 그 순간처럼, 어짜피 이것 밖에 난 못해   0   0   0
2                       너를 사랑하는 것 밖엔 못해   0   0   1

In [112]:
doc1= ['사과', '오렌지', '수박']
doc2= ['토마토', '수박', '토마토']
doc3= ['사과', '토마토', '사과',]
df=pd.DataFrame(list(zip(doc1, doc2, doc3)))
df

     0    1    2
0   사과  토마토   사과
1  오렌지   수박  토마토
2   수박  토마토   사과

In [113]:
set(df[0].values)
set(df[1].values)
set(df[2].values)

{'사과', '수박', '오렌지'}

{'수박', '토마토'}

{'사과', '토마토'}

In [114]:
choices = set(df[0].values) | (set(df[1].values)) | (set(df[2].values))
choices
type(choices)

{'사과', '수박', '오렌지', '토마토'}

set

In [115]:
df['all'] = df.apply(','.join, axis=1)
df

     0    1    2         all
0   사과  토마토   사과   사과,토마토,사과
1  오렌지   수박  토마토  오렌지,수박,토마토
2   수박  토마토   사과   수박,토마토,사과

In [116]:
for choice in choices :
    df[choice] = df['all'].str.contains(choice)*1
df

     0    1    2         all  토마토  사과  오렌지  수박
0   사과  토마토   사과   사과,토마토,사과    1   1    0   0
1  오렌지   수박  토마토  오렌지,수박,토마토    1   0    1   1
2   수박  토마토   사과   수박,토마토,사과    1   1    0   1

In [117]:
txt = '%    ?필 땐 /장미꽃:처럼!, 흩날릴\t 땐 !벚꽃처럼, $질 땐 나팔꽃처럼'
txt2 = '!아름다운 ?그 <순간처럼>, !어짜피 %이것 밖에 난 못해'
txt3 = '너를 %%사랑하는 것% 밖엔 못해'
doc = pd.Series([txt, txt2, txt3], dtype="string").to_frame()
doc

                                              0
0  %    ?필 땐 /장미꽃:처럼!, 흩날릴	 땐 !벚꽃처럼, $질 땐 나팔꽃처럼
1             !아름다운 ?그 <순간처럼>, !어짜피 %이것 밖에 난 못해
2                            너를 %%사랑하는 것% 밖엔 못해

In [118]:
import re
p = re.compile('처럼')
print(p.findall(txt))

['처럼', '처럼', '처럼']

In [119]:
regex = ['[%]', '[?]', '[!]', '[/]', '[$]', '[>]', '[<]', '[:]', '\t']
def RegularClear(regex) :
    for pattern in regex :
        p = re.compile(pattern)
        doc[0] = doc[0].apply(lambda x : re.sub(p, '', str(x)))
    return doc[0]

In [120]:
RegularClear(regex)
doc

0        필 땐 장미꽃처럼, 흩날릴 땐 벚꽃처럼, 질 땐 나팔꽃처럼
1             아름다운 그 순간처럼, 어짜피 이것 밖에 난 못해
2                         너를 사랑하는 것 밖엔 못해
Name: 0, dtype: object

                                      0
0      필 땐 장미꽃처럼, 흩날릴 땐 벚꽃처럼, 질 땐 나팔꽃처럼
1           아름다운 그 순간처럼, 어짜피 이것 밖에 난 못해
2                       너를 사랑하는 것 밖엔 못해

# End